---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures
source: html/f887cbef-75a8-1d6f-c870-a4e1428c7ca7.htm
---
# BuiltInFailures.SiteImportFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.